## All questions of assignments are summarized below.

#### Task 1: Basic Python operations

1.1 Read the data file into Python as a pandas data frame

In [6]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [7]:
# Import a package and read data
import pandas
import pandas as pd
dat = pd.read_csv('/content/drive/MyDrive/train.csv')
# Print the data frame
print(dat)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

1.2 Print the top 5 rows from the dataset

In [8]:
# Print the top 5 rows from the dataset
data = dat.head()
print(data)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

1.3 Print selected columns (survived, pclass, sex, cabin)

In [38]:
# Print columns Survived, Pclass, Sex, Cabin
data = dat[['Survived', 'Pclass', 'Sex', 'Cabin']]
print(data)

     Survived  Pclass     Sex Cabin
0           0       3    male   NaN
1           1       1  female   C85
2           1       3  female   NaN
3           1       1  female  C123
4           0       3    male   NaN
..        ...     ...     ...   ...
886         0       2    male   NaN
887         1       1  female   B42
888         0       3  female   NaN
889         1       1    male  C148
890         0       3    male   NaN

[891 rows x 4 columns]

1.4 Print survived people who are older than 50 or in the upper socio-economic status (pclass is 1).

In [39]:
# Print survived people who are older than 50 or in the upper socio-economic status
data = dat[(dat['Survived'] == 1) & ((dat['Age'] > 50) | (dat['Pclass'] == 1))]
print(data)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1              2         1       1  ...  71.2833   C85         C
3              4         1       1  ...  53.1000  C123         S
11            12         1       1  ...  26.5500  C103         S
15            16         1       2  ...  16.0000   NaN         S
23            24         1       1  ...  35.5000    A6         S
..           ...       ...     ...  ...      ...   ...       ...
862          863         1       1  ...  25.9292   D17         S
871          872         1       1  ...  52.5542   D35         S
879          880         1       1  ...  83.1583   C50         C
887          888         1       1  ...  30.0000   B42         S
889          890         1       1  ...  30.0000  C148         C

[140 rows x 12 columns]

-----------------

#### Task 2: Data cleansing and summary

2.1 Data variable type description

Please describe the data type for each variable in the dataset - whether it is a qualitative or quantitative variable. If you think the variable is quantitative, please indicate whether it is categorical or numerical variable.

Qualitative variables: PassengerID, Name


Quantitative variables_Categorical variables: Survived, Pclass, Sex, Ticket, Cabin, Embarked, Sibsp, Parch


Quantitative variables_Numerical variables: Age, Fare

2.2 Assume we want to run analysis on variables: Survived, Pclass, Sex, Age, Fare, Embarked.

2.2.1 Please create a subset of data which only contains selected variables.

In [40]:
# Create a subset to store 6 columns' information. 
subset = dat[['Survived', 'Pclass', 'Sex', 'Age', 'Fare', 'Embarked']]

# and print it
print(subset)

     Survived  Pclass     Sex   Age     Fare Embarked
0           0       3    male  22.0   7.2500        S
1           1       1  female  38.0  71.2833        C
2           1       3  female  26.0   7.9250        S
3           1       1  female  35.0  53.1000        S
4           0       3    male  35.0   8.0500        S
..        ...     ...     ...   ...      ...      ...
886         0       2    male  27.0  13.0000        S
887         1       1  female  19.0  30.0000        S
888         0       3  female   NaN  23.4500        S
889         1       1    male  26.0  30.0000        C
890         0       3    male  32.0   7.7500        Q

[891 rows x 6 columns]

2.2.2 Use Python code to check whether any variable has missing value.

In [41]:
# Checking whether any variable has missing value. 
# .count() function will help to check number of non-missing values in each column. 
# If the value is smaller than the number of rows, the column has missing value.
# So Age and Embarked variable have missing value
subset.count()

Survived    891
Pclass      891
Sex         891
Age         714
Fare        891
Embarked    889
dtype: int64

2.2.3 Please clean the dataset by either removing or replacing missing value.

In [42]:
# Remove missing value
"""Delete missing value"""
# Drop all rows with missing values
subset_new=subset.dropna()
subset_new

     Survived  Pclass     Sex   Age     Fare Embarked
0           0       3    male  22.0   7.2500        S
1           1       1  female  38.0  71.2833        C
2           1       3  female  26.0   7.9250        S
3           1       1  female  35.0  53.1000        S
4           0       3    male  35.0   8.0500        S
..        ...     ...     ...   ...      ...      ...
885         0       3  female  39.0  29.1250        Q
886         0       2    male  27.0  13.0000        S
887         1       1  female  19.0  30.0000        S
889         1       1    male  26.0  30.0000        C
890         0       3    male  32.0   7.7500        Q

[712 rows x 6 columns]

2.2.4 If you identify any categorical variable(s), please use one-hot encoding to convert the variables.

In [43]:
# Convert 'Survived' column into dummies
Survived_dummy = pd.get_dummies(subset_new['Survived'], prefix = 'Survived')
Survived_dummy

     Survived_0  Survived_1
0             1           0
1             0           1
2             0           1
3             0           1
4             1           0
..          ...         ...
885           1           0
886           1           0
887           0           1
889           0           1
890           1           0

[712 rows x 2 columns]

In [44]:
# Convert 'Pclass' column into dummies
Pclass_dummy = pd.get_dummies(subset_new['Pclass'], prefix = 'Pclass')
Pclass_dummy

     Pclass_1  Pclass_2  Pclass_3
0           0         0         1
1           1         0         0
2           0         0         1
3           1         0         0
4           0         0         1
..        ...       ...       ...
885         0         0         1
886         0         1         0
887         1         0         0
889         1         0         0
890         0         0         1

[712 rows x 3 columns]

In [45]:
# Convert 'Sex' column into dummies
Sex_dummy = pd.get_dummies(subset_new['Sex'], prefix = 'Sex')
Sex_dummy

     Sex_female  Sex_male
0             0         1
1             1         0
2             1         0
3             1         0
4             0         1
..          ...       ...
885           1         0
886           0         1
887           1         0
889           0         1
890           0         1

[712 rows x 2 columns]

In [46]:
# Convert 'Embarked' column into dummies
Embarked_dummy = pd.get_dummies(subset_new['Embarked'], prefix = 'Embarked')
Embarked_dummy

     Embarked_C  Embarked_Q  Embarked_S
0             0           0           1
1             1           0           0
2             0           0           1
3             0           0           1
4             0           0           1
..          ...         ...         ...
885           0           1           0
886           0           0           1
887           0           0           1
889           1           0           0
890           0           1           0

[712 rows x 3 columns]

In [48]:
# use concat() function to horizontally append them together. 
# By setting the axis = 1
data_new = pd.concat([subset_new, Survived_dummy, Pclass_dummy, Sex_dummy, Embarked_dummy], axis = 1)
data_new

     Survived  Pclass     Sex  ...  Embarked_C  Embarked_Q Embarked_S
0           0       3    male  ...           0           0          1
1           1       1  female  ...           1           0          0
2           1       3  female  ...           0           0          1
3           1       1  female  ...           0           0          1
4           0       3    male  ...           0           0          1
..        ...     ...     ...  ...         ...         ...        ...
885         0       3  female  ...           0           1          0
886         0       2    male  ...           0           0          1
887         1       1  female  ...           0           0          1
889         1       1    male  ...           1           0          0
890         0       3    male  ...           0           1          0

[712 rows x 16 columns]

2.2.5 At the end, please get the final dataset, which only contains selected variable and is well cleaned.

In [49]:
print(data_new)
# Idicate the number of observations in the dataset
# We see in the output [712 rows x 16 columns], there are 712 rows so there are 712 observations in the dataset

     Survived  Pclass     Sex  ...  Embarked_C  Embarked_Q Embarked_S
0           0       3    male  ...           0           0          1
1           1       1  female  ...           1           0          0
2           1       3  female  ...           0           0          1
3           1       1  female  ...           0           0          1
4           0       3    male  ...           0           0          1
..        ...     ...     ...  ...         ...         ...        ...
885         0       3  female  ...           0           1          0
886         0       2    male  ...           0           0          1
887         1       1  female  ...           0           0          1
889         1       1    male  ...           1           0          0
890         0       3    male  ...           0           1          0

[712 rows x 16 columns]

2.3 Data Summary using the cleaned dataset from question 2.2.5.

2.3.1 Print the descriptive statistics table

In [50]:
# Use "describe()" function to see all statistics
data = data_new.describe()
print(data)

         Survived      Pclass         Age  ...  Embarked_C  Embarked_Q  Embarked_S
count  712.000000  712.000000  712.000000  ...  712.000000  712.000000  712.000000
mean     0.404494    2.240169   29.642093  ...    0.182584    0.039326    0.778090
std      0.491139    0.836854   14.492933  ...    0.386597    0.194506    0.415823
min      0.000000    1.000000    0.420000  ...    0.000000    0.000000    0.000000
25%      0.000000    1.000000   20.000000  ...    0.000000    0.000000    1.000000
50%      0.000000    2.000000   28.000000  ...    0.000000    0.000000    1.000000
75%      1.000000    3.000000   38.000000  ...    0.000000    0.000000    1.000000
max      1.000000    3.000000   80.000000  ...    1.000000    1.000000    1.000000

[8 rows x 14 columns]

2.3.2 Print the correlation matrix using numerical variables.

In [51]:
# Print correlation matrix using numerical variables
data = data_new[['Age', 'Fare']].corr()
print(data)

           Age      Fare
Age   1.000000  0.093143
Fare  0.093143  1.000000

2.3.3 Print the frequency table(s) for all categorical variables. (Note: the frequency table should include the label of each category and the number of observations in each category)

In [52]:
# Print the frequency table for the 'Survived' variable
data = data_new['Survived'].value_counts()
print(data)

0    424
1    288
Name: Survived, dtype: int64

In [53]:
# Print the frequency table for the 'Pclass' variable
data = data_new['Pclass'].value_counts()
print(data)

3    355
1    184
2    173
Name: Pclass, dtype: int64

In [54]:
# Print the frequency table for the 'Sex' variable
data = data_new['Sex'].value_counts()
print(data)

male      453
female    259
Name: Sex, dtype: int64

In [55]:
# Print the frequency table for the 'Embarked' variable
data = data_new['Embarked'].value_counts()
print(data)

S    554
C    130
Q     28
Name: Embarked, dtype: int64

-------------

#### Task 3: Essay on Problem Definition

Essay: Customer churn prediction in telecom companies using machine learning in big data platform


3.1 Come up with a general business problem (for a firm or an industry)


Churn quantifies the number of customers who have unsubscribed or canceled their service contract.

The churn rate, also known as the rate of attrition or customer churn, is the rate at which customers stop doing business with an entity. It is most commonly expressed as the percentage of service subscribers who discontinue their subscriptions within a given time period. 

A high customer churn rate indicates that the companies are losing customers at an alarming rate, it directs effect on the revenues of the companies, especially in the telecom field, telecom companies are seeking to develop means to predict potential customer to churn.



3.2 Break the business problem in to data science problems. You only need to list ONE data science problem.


The problem of losing many customers, has the direct impact of decreased revenues, which affects telecom companies, so a good starting point would be to reduce customer churn by identifying potential churn candidates beforehand and taking proactive actions to make them stay.



3.3 Please indicate whether it is a descriptive/predictive/prescriptive analysis, and which machine learning algorithm can be used to solve the problem (supervised or unsupervised)

It uses a predictive analysis to predict if a customer will churn or not.

Machine learning algorithm can be used to solve the problem is based on supervised learning.